{
  "meta": {
    "version": "1.0.0",
    "description": "BarakahCLI content library. All strings are stored here for easy editing and localization.",
    "note": "Each array is randomly sampled at runtime. Add or remove entries freely."
  },

  "niyyah": {
    "greeting": "Bismillah! As-salamu alaykum. Before we write code, let's correct our Niyyah (Intention). What are we building for today?",
    "acknowledgments": [
      "Bismillah. May Allah put Barakah in your keystrokes.",
      "Bismillah. A worthy intention. Let's begin with purpose.",
      "Bismillah. May this session be a source of beneficial knowledge.",
      "Bismillah. With the right Niyyah, even refactoring becomes ibadah."
    ],
    "default_skip": "Proceeding with the intention of beneficial knowledge. Bismillah."
  },

  "sabr": {
    "snippets": [
      "Verily, with every StackOverflowError, there is ease. (Quran 94:6, developer edition)",
      "This bug is a test of your Sabr. Do not let the Shaitan of Syntax distract you.",
      "404: Khushoo (Focus) not found. Take a breath, make Istighfar, and try again.",
      "Allah loves those who are patient — and those who write unit tests.",
      "Remember, anger eats away good deeds like fire eats wood. Take a breath. Let's look at the error log together.",
      "Even Musa (AS) had to debug the staff trick. Patience, developer.",
      "The Prophet ﷺ said: 'No fatigue, nor disease, nor anxiety...' — and yes, that includes NullPointerExceptions.",
      "Before you mass-delete code in frustration, remember: Istighfar first, git reset second.",
      "Every senior developer was once mass-printing 'WHY DOESN'T THIS WORK'. You're on the right path.",
      "A moment of Sabr in a moment of anger saves you a hundred moments of regret — and a force push to main.",
      "This too shall compile. Have patience.",
      "The compiler is not your enemy. The real jihad is against spaghetti code."
    ]
  },

  "shukr": {
    "snippets": [
      "Alhamdulillah. It works! (Don't forget to commit.)",
      "Success is from Allah; the bugs are from our own hands.",
      "Masha'Allah. A clean build is a blessing.",
      "Alhamdulillah. All tests passing — a true ni'mah (blessing).",
      "Subhan'Allah. From red to green. Remember to thank the One who guided your logic.",
      "Masha'Allah, tabarakAllah! Ship it before qadr changes. (Just kidding. Write tests first.)",
      "This moment of success is a gift. Alhamdulillah 'ala kulli haal.",
      "Alhamdulillah. The code compiles, the tests pass, and your Niyyah is intact.",
      "Every resolved bug is a small victory. Alhamdulillah for debugging skills."
    ]
  },

  "barakah_timer": {
    "reminders": [
      "You've been coding for a while. Is it time for a stretch or a Dhikr break?",
      "Code requires logic; the soul requires remembrance. SubhanAllah.",
      "Pause check: Have you had water? (If you're not fasting!) Have you prayed?",
      "Your body is an Amanah (trust). Step away from the screen for a moment.",
      "The Prophet ﷺ encouraged moderation in all things — including coding sprints.",
      "A 2-minute Dhikr break now could save you an hour of brain fog later.",
      "Quick reset: Close your eyes. Say SubhanAllah 33 times. Then come back sharper, insha'Allah.",
      "Time check: Is Salah approaching? The best code can wait for the best obligation."
    ],
    "ramadan_reminders": [
      "Ramadan mode: Your energy is precious. Prioritize, don't overcommit.",
      "Fasting tip: This is the hour to tackle the hardest problem — your mind is sharp from discipline.",
      "Ramadan reminder: If you're feeling the fast, that's your body making du'a. Take it easy.",
      "The Barakah of Ramadan extends to your code. Trust the process, even if velocity drops.",
      "Suhoor energy check: If you skipped Suhoor, be gentle with yourself today."
    ]
  },

  "quran_verses": [
    { "surah": 94,  "ayah": 5,   "name": "Al-Inshirah 94:5",    "note": "Verily, with hardship comes ease." },
    { "surah": 2,   "ayah": 286, "name": "Al-Baqarah 2:286",    "note": "Allah does not burden a soul beyond what it can bear." },
    { "surah": 2,   "ayah": 255, "name": "Ayat al-Kursi",        "note": "Allah — there is no deity except Him, the Ever-Living, the Sustainer." },
    { "surah": 14,  "ayah": 7,   "name": "Ibrahim 14:7",         "note": "If you are grateful, I will surely increase you." },
    { "surah": 13,  "ayah": 11,  "name": "Ar-Ra'd 13:11",        "note": "Allah will not change the condition of a people until they change themselves." },
    { "surah": 65,  "ayah": 3,   "name": "At-Talaq 65:3",        "note": "Whoever relies upon Allah, He is sufficient for him." },
    { "surah": 39,  "ayah": 53,  "name": "Az-Zumar 39:53",       "note": "Do not despair of the mercy of Allah." },
    { "surah": 3,   "ayah": 200, "name": "Ali 'Imran 3:200",     "note": "Be patient and persevere." },
    { "surah": 2,   "ayah": 153, "name": "Al-Baqarah 2:153",     "note": "Seek help through patience and prayer." },
    { "surah": 16,  "ayah": 97,  "name": "An-Nahl 16:97",        "note": "Whoever does righteous deeds — We will give them a good life." },
    { "surah": 93,  "ayah": 5,   "name": "Ad-Duha 93:5",         "note": "Your Lord will give to you, and you will be satisfied." },
    { "surah": 55,  "ayah": 13,  "name": "Ar-Rahman 55:13",      "note": "So which of the favors of your Lord would you deny?" }
  ],

  "session_end": {
    "snippets": [
      "JazakAllahu Khairan for this session. May your code be a Sadaqah Jariyah.",
      "Session complete. Remember: the best deeds are those done consistently, even if small. Same goes for commits.",
      "Alhamdulillah for the work done today. What wasn't finished is tomorrow's Barakah, insha'Allah."
    ]
  }
}
